export interface QA {
    q: string
    a: string
}

export const qa: QA[] = [
    {
        q: '这是什么网站？',
        a: '这是一个 Warframe 的组队网站，并且数据与游戏内无关，无关，无关，数据不互通',
    },
    {
        q: '我怎么改名？',
        a: '< 当前页面右上角 >，双击名字即可显示输入框进行修改',
    },
    {
        q: '怎么发布组队信息？',
        a: '< 当前页面左上角 >，一排图标下面，可以看到你的头像，点它，或者它旁边的加号都可以呼出组队信息表单，填写完即可发布',
    },
    {
        q: '怎么没人发组队信息？',
        a: '网站刚起步，大伙儿都不知道怎么用，在线用户也少，功能也不太全，所以没人发，不过我已经在很努力地更新了！',
    },
    {
        q: '我发了组队信息，怎么没人来？',
        a: '网站人太少，或检查游戏内是否公开组队，亦可以在游戏内改为单人模式后再公开组队，以创建组队进程',
    },
    {
        q: '网站有多少人在用？',
        a: '网站于 2023.9.27 发布，目前注册用户40多人，已验证账户的用户在半数以上',
    },
    {
        q: '我怎么验证账户？',
        a: '在注册后，< 如果邮箱有效 >，会收到一封验证邮件，点击邮件中的链接即可完成验证，在那里也可以改用户名',
    },
    {
        q: '怎么看在线人数？',
        a: '< 当前页面左上角 >，有一排和游戏内很像的图标，红点里的数字就是当前频道的在线人数，而且是实时更新的',
    },
    {
        q: '这里的数据跟游戏内绑定吗？',
        a: '!!!毫无关联!!!，这里的信息只是为了方便大家组队，不会影响游戏内的信息',
    },
    {
        q: '网站多久更新一次？',
        a: '< 随时 >，这意味着网站很有可能突然就无法访问了，因为我把服务器关了，下一个版本会更好！',
    },
    {
        q: '有群吗？怎么联系到开发者？我想提建议！',
        a: '< Q群 > 376878510，仅此一个',
    },
]
